#include<stdio.h>

int main (void)
{
//시험 점수가 60점 이상이면 합격인 자격증 시험이 있다.
//점수는 78점이다. 점수를 저장할 변수명은 score.
//변수 score를 선언하고 초기값으로 0을 배정하시오.
//변수 score 에 시험점수 60점을 배정하시오. 
	int score = 0;
		score = 78;

		if(score>=60){
			printf("합격입니다.");
}
//-----------------------------------------------------------------------------------
		if(score<60){
			printf("불합격입니다.");
}

//---------------방법 1-------------------------------------------------------------- 
		else{
			printf("불합격입니다.");
}

//===============================================================================

// 점수를 A~F등급으로 나누는 프로그램을 작성하시오.
// A : 90점대, B : 80점대, C : 70점대, D : 60점대, F : 60점 미만.
//점수를 입력받고 등급을 출력하시오. 
	int score = 0;
			printf("점수를 입력하시오 :");
				scanf("%d",&score);
			
		if (score>=90)
				printf("A");
		
		if (score<90 && score >=80)
				printf("B");
		
		if (score<80 && score >=70)
				printf("C");
			
		if (score<70 && score >=60)
				printf("D");
			
		if (score<60)
				printf("F");
			
	return 0;
}